<a href="https://colab.research.google.com/github/DhruvRajSingh-Coder/LetsUpgrade-AI-ML/blob/master/Day16%2C17_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
Data=pd.read_csv("https://raw.githubusercontent.com/LetsUpgrade/AI-ML-July-2020/master/Day-16%2C17/Assingment/Dataset%20for%20Pandas%20Assinment/titles.csv")
Data.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

In [ ]:
from google.colab import drive
drive.mount("/content/drive")

Go to this URL in a browser: https://accounts.google.com/o/oauth2/auth?client_id=947318989803-6bn6qk8qdgf4n4g3pfee6491hc0brc4i.apps.googleusercontent.com&redirect_uri=urn%3aietf%3awg%3aoauth%3a2.0%3aoob&scope=email%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdocs.test%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive.photos.readonly%20https%3a%2f%2fwww.googleapis.com%2fauth%2fpeopleapi.readonly&response_type=code

Enter your authorization code:
··········
Mounted at /content/drive

In [ ]:
path="/content/drive/My Drive/cast.csv"
Data1=pd.read_csv(path)
Data1.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [ ]:
Data2=pd.read_csv("https://raw.githubusercontent.com/raone612/LUFiles/master/release_dates.csv")
Data2.head()

                    title  year      country        date
0   #73, Shaanthi Nivaasa  2007        India  2007-06-15
1                   #BKKY  2016     Cambodia  2017-10-12
2                 #Beings  2015      Romania  2015-01-29
3               #Captured  2017          USA  2017-09-05
4  #Ewankosau saranghaeyo  2015  Philippines  2015-01-21

__1.
How many movies are listed in the titles dataframe?__

In [ ]:
A=Data.title.count()
print("The number of movies listed in the titles dataframe is: \n",A)

The number of movies listed in the titles dataframe is:
 244914

__2. What are the earliest two films listed in the titles dataframe?__

In [ ]:
B=Data.sort_values("year").head(2)
print ("The earliest two films listed in the titles data frame are:\n",B)

The earliest two films listed in the titles data frame are:
                      title  year
193222          Miss Jerry  1894
51388   The Startled Lover  1898

__3. How many movies have the title "Hamlet"?__

In [ ]:
C=Data.title[Data.title=="Hamlet"].count()
print ("Number of movies having the title 'Hamlet' are:\n",C)

Number of movies having the title 'Hamlet' are:
 20

__4. How many movies are titled "North by Northwest"?__

In [ ]:
D=Data.title[Data.title=="North by Northwest"].count()
print ("Number of movies having the title 'North by Northwest' is:\n",D)

Number of movies having the title 'North by Northwest' is:
 1

__5. When was the first movie titled "Hamlet" made?__

In [ ]:
E=Data[Data.title=="Hamlet"].sort_values("year").head(1)
print ("The first movie titled 'Hamlet' was made in:\n",E)

The first movie titled 'Hamlet' was made in:
         title  year
52521  Hamlet  1910

__6. List all of the "Treasure Island" movies from earliest to most recent.__

In [ ]:
F=Data[Data.title=="Treasure Island"].sort_values("year")
print ("All the 'Treasure Island' movies are as follows:\n",F)

All the 'Treasure Island' movies are as follows:
                   title  year
55686   Treasure Island  1918
196514  Treasure Island  1920
141822  Treasure Island  1934
77354   Treasure Island  1950
65051   Treasure Island  1972
37238   Treasure Island  1973
173051  Treasure Island  1985
27076   Treasure Island  1999

__7. How many movies were made in the year 1950?__

In [ ]:
print ("Number of movies made in the year 1950 are:")
Data[Data.year==1950].year.count()

Number of movies made in the year 1950 are:

1113

__8. How many movies were made in the year 1960?__

In [ ]:
print ("Number of movies made in the year 1960 are:")
Data[Data.year==1960].year.count()

Number of movies made in the year 1960 are:

1549

__9. How many movies were made from 1950 through 1959?__

In [ ]:
print ("Number of movies made from 1950 through 1959 are:")
Data[(Data.year > 1950)&(Data.year <= 1959)].title.count()

Number of movies made from 1950 through 1959 are:

11821

__10. In what years has a movie titled "Batman" been released?__

In [ ]:
print ("Years in which movie titled 'Batman' has been released are:")
Data[Data["title"]=="Batman"].year.to_list()

Years in which movie titled 'Batman' has been released are:

[1943, 1989]

__11. How many roles were there in the movie "Inception"?__

In [ ]:
print ("Number of roles in the movie 'Inception' are:")
count=Data1[Data1.title=='Inception'].character.unique()
len(count)

Number of roles in the movie 'Inception' are:

56

__12. How many roles in the movie "Inception" are NOT ranked by an "n" value?__

In [ ]:
print ("Number of roles in the movie 'Inception' not ranked by an 'n' value are:")
Data1[Data1.title=='Inception'].n.isnull().sum()

Number of roles in the movie 'Inception' not ranked by an 'n' value are:

27

__13. But how many roles in the movie "Inception" did receive an "n" value?__

In [ ]:
print ("Number of roles in the movie 'Inception' did receive and 'n' value are:")
Data1[Data1.title=='Inception'].n.count()

Number of roles in the movie 'Inception' did receive and 'n' value are:

51

__14. Display the cast of "North by Northwest" in their correct "n"-value order ignoring roles that did not earn a numeric "n" value.__

In [ ]:
Data1[Data1.title=='North by Northwest'].dropna(axis=0).sort_values('n')

                      title  year  ...                    character     n
871426   North by Northwest  1959  ...           Roger O. Thornhill   1.0
3518333  North by Northwest  1959  ...                  Eve Kendall   2.0
1457165  North by Northwest  1959  ...              Phillip Vandamm   3.0
3157232  North by Northwest  1959  ...              Clara Thornhill   4.0
356707   North by Northwest  1959  ...                The Professor   5.0
3048272  North by Northwest  1959  ...                Mrs. Townsend   6.0
1695173  North by Northwest  1959  ...              Lester Townsend   7.0
1275337  North by Northwest  1959  ...                      Leonard   8.0
2447081  North by Northwest  1959  ...                     Valerian   9.0
1811387  North by Northwest  1959  ...              Victor Larrabee  10.0
665768   North by Northwest  1959  ...                        Licht  11.0
2295714  North by Northwest  1959  ...                   Auctioneer  12.0
464736   North by Northwest  1959  ...                    Dr. Cross  13.0
1508344  North by Northwest  1959  ...               Sergeant Flamm  14.0
206471   North by Northwest  1959  ...               Captain Junket  15.0
1384780  North by Northwest  1959  ...  Charley - Chicago Policeman  16.0

[16 rows x 6 columns]

__15. Display the entire cast,in "n" order,of the 1972 film "Slueth".__

In [ ]:
Data1[(Data1.title=='Sleuth')&(Data1.year==1972)].sort_values('n')

          title  year  ...                   character    n
1705394  Sleuth  1972  ...                 Andrew Wyke  1.0
326773   Sleuth  1972  ...                 Milo Tindle  2.0
373876   Sleuth  1972  ...           Inspector Doppler  3.0
1465483  Sleuth  1972  ...  Detective Sergeant Tarrant  4.0
2724553  Sleuth  1972  ...             Marguerite Wyke  5.0
1448690  Sleuth  1972  ...      Police Constable Higgs  6.0

[6 rows x 6 columns]

__16. Now display the entire cast, in "n" order,of the 2007 version of "Sleuth".__

In [ ]:
Data1[(Data1.title=='Sleuth')&(Data1.year==2007)].sort_values('n')

          title  year                 name     type          character    n
326774   Sleuth  2007        Michael Caine    actor             Andrew  1.0
1293634  Sleuth  2007             Jude Law    actor               Milo  2.0
1805907  Sleuth  2007        Harold Pinter    actor        Man on T.V.  3.0
260242   Sleuth  2007      Kenneth Branagh    actor  Other Man on T.V.  NaN
373877   Sleuth  2007  Alec (II) Cawthorne    actor  Inspector Doppler  NaN
2724552  Sleuth  2007    Eve (II) Channing  actress    Marguerite Wyke  NaN
3370424  Sleuth  2007    Carmel O'Sullivan  actress             Maggie  NaN

__17. How many roles were credited in the silent 1921 version of Hamlet?__

In [ ]:
print ("Number of roles credited in the silent 1921 version of Hamlet are:")
Data1[(Data1.title=='Hamlet')&(Data1.year==1921)].character.count()

Number of roles credited in the silent 1921 version of Hamlet are:

9

__18. How many roles were credited in Branagh's 1996 Hamlet?__

In [ ]:
print ("Number of roles credited in Branagh's 1996 Hamlet are:")
Data1[(Data1.title=='Hamlet')&(Data1.year==1996)].character.count()

Number of roles credited in Branagh's 1996 Hamlet are:

54

__19. How many "Hamlet" roles have been listed in all film credits through history?__

In [ ]:
print ("Number of 'Hamlet' roles which have been listed in all film credits through history are:")
len(Data1[(Data1.title=='Hamlet')])

Number of 'Hamlet' roles which have been listed in all film credits through history are:

342

__20. How many people have played an "Ophelia"?__

In [ ]:
print ("Number of people played an 'Ophelia' are:")
Data1 [Data1.character=='Ophelia'].character.count()

Number of people played an 'Ophelia' are:

117

__21. How many people have played a role called "The Dude"?__

In [ ]:
print ("Number of people played a role called 'The Dude' are:")
Data1[Data1.character=='The Dude'].character.count()

Number of people played a role called 'The Dude' are:

19

__22. How many people have played a role called "The Stranger"?__

In [ ]:
print ("Number of people played a role called 'The Stranger' are:")
Data1[Data1.character=='The Stranger'].character.count()

Number of people played a role called 'The Stranger' are:

212

__23. How many roles has Sidney Poitier played throughout his career?__

In [ ]:
print ("Number of roles Sidney Poitier has played throughout his career are:")
Data1 [Data1.name=='Sidney Poitier'].name.count()

Number of roles Sidney Poitier has played throughout his career are:

43

__24. How many roles has Judi Dench played?__

In [ ]:
print ("Number of roles Judi Dench has played are:")
Data1 [Data1.name=='Judi Dench'].name.count()

Number of roles Judi Dench has played are:

55

__25. List the supporting roles(having n=2) played by Cary Grant in the 1940s, in order by year.__

In [ ]:
Data1[(Data1.name=='Cary Grant')&(Data1.n==2)&(Data1.year>=1940)&(Data1.year<=1949)].sort_values('year')

                   title  year        name   type    character    n
871423  My Favorite Wife  1940  Cary Grant  actor   Nick Arden  2.0
871433    Penny Serenade  1941  Cary Grant  actor  Roger Adams  2.0

__26. List the leading roles that Carry Grant played in the 1940s in order by year.__

In [ ]:
 Data1[(Data1.name=='Cary Grant')&(Data1.n==1)&(Data1.year>=1940)&(Data1.year<=1949)].sort_values('year')

                                       title  ...    n
871448               The Howards of Virginia  ...  1.0
871407                       His Girl Friday  ...  1.0
871450                The Philadelphia Story  ...  1.0
871438                             Suspicion  ...  1.0
871452                  The Talk of the Town  ...  1.0
871429                 Once Upon a Honeymoon  ...  1.0
871398                     Destination Tokyo  ...  1.0
871422                             Mr. Lucky  ...  1.0
871430                      Once Upon a Time  ...  1.0
871390                  Arsenic and Old Lace  ...  1.0
871425             None But the Lonely Heart  ...  1.0
871424                         Night and Day  ...  1.0
871427                             Notorious  ...  1.0
871444      The Bachelor and the Bobby-Soxer  ...  1.0
871445                     The Bishop's Wife  ...  1.0
871421  Mr. Blandings Builds His Dream House  ...  1.0
871402          Every Girl Should Be Married  ...  1.0
871411                I Was a Male War Bride  ...  1.0

[18 rows x 6 columns]

__27. How many roles were available for actors in the 1950s?__

In [ ]:
print ("Number of roles which were available for the actors in 1950s are:")
len(Data1[(Data1.year>=1950)&(Data1.year<1960)&(Data1.type=='actor')].type)

Number of roles which were available for the actors in 1950s are:

157738

__28. How many roles were available for actresses in 1950s?__

In [ ]:
print ("Number of roles which were available for the actresses in 1950s are:")
len(Data1[(Data1.year>=1950)&(Data1.year<1960)&(Data1.type=='actress')].type)

Number of roles which were available for the actresses in 1950s are:

57733

__29. How many leading roles (n=1) were available from the beginning of film history through 1980?__

In [ ]:
print ("Number of leading roles (n=1) which were available from the beginning of film history through 1980 are:")
Data1[(Data1.n==1)&(Data1.year<=1980)].character.count()

Number of leading roles (n=1) which were available from the beginning of film history through 1980 are:

65140

__30. How many non leading roles were available through from the beginning of film history through 1980?__

In [ ]:
print ("Number of non leading roles which were available through from the beginning of film history through 1980 are:")
(Data1[Data1.year<=1980].character.count())-(Data1[(Data1.n==1)&(Data1.year<=1980)].character.count())

Number of non leading roles which were available through from the beginning of film history through 1980 are:

1117667

__31. How many roles through 1980 minor enough that they did not warrant a numeric "n" rank?__

In [ ]:
print ("Number of roles through 1980 minor enough that they did not warrant numeric 'n' rank are:")
Data1[Data1.year==1980].n.isnull().sum()

Number of roles through 1980 minor enough that they did not warrant numeric 'n' rank are:

4466